Revit 2024 API
IFCFile.CreateStyle Method
Overload List
Name | Description
CreateStyle(ExporterIFC, IFCAnyHandle)
 Creates and populates an IfcStyledItem for an IfcRepresentationItem with a IfcSurfaceStyle, IfcCurveStyle, and/or an IfcFillStyle, and assigns them to the file.
CreateStyle(ExporterIFC, IFCAnyHandle, Color, ElementId)
 Creates and populates an IfcStyledItem for an IfcRepresentationItem with a IfcSurfaceStyle, IfcCurveStyle, and/or an IfcFillStyle, and assigns them to the file.
See Also
IFCFile Class
IFCFile Members
Autodesk.Revit.DB.IFC Namespace